test/graphs/graph_test_11.dot
digraph unix {
  graph [ dpi = 75 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Helvetica,Arial,sans-serif"
  node [fontname="Helvetica,Arial,sans-serif"]
  edge [fontname="Helvetica,Arial,sans-serif"]
  subgraph cluster_root_2 {
    label = "root"; // scope
    invisible [label = "", shape = point, style=invis]; // root
    subgraph cluster_butterFly_4 {
      label = "butterFly"; // scope
      invisible [label = "", shape = point, style=invis]; // butterFly
      subgraph cluster_level3_6 {
        label = "level3"; // scope
        s111_0 [
          label = "s111"; // node
        ];
        c111_14 [
          label = "c111"; // node
        ];
        subgraph cluster_level2_8 {
          label = "level2"; // scope
          s11_1 [
            label = "s11"; // node
          ];
          s10_2 [
            label = "s10"; // node
          ];
          s01_3 [
            label = "s01"; // node
          ];
          s00_4 [
            label = "s00"; // node
          ];
          c00_10 [
            label = "c00"; // node
          ];
          c01_11 [
            label = "c01"; // node
          ];
          c10_12 [
            label = "c10"; // node
          ];
          c11_13 [
            label = "c11"; // node
          ];
          subgraph cluster_level1_10 {
            label = "level1"; // scope
            s1_5 [
              label = "s1"; // node
            ];
            s0_6 [
              label = "s0"; // node
            ];
            c0_8 [
              label = "c0"; // node
            ];
            c1_9 [
              label = "c1"; // node
            ];
            subgraph cluster_level0_12 {
              label = "level0"; // scope
              x_7 [
                label = "x"; // node
              ];
              
            }
            
          }
          
        }
        
      }
      
    }
    
  }
  "s111_0" -> "s11_1";
  "s11_1" -> "s1_5";
  "s10_2" -> "s1_5";
  "s01_3" -> "s0_6";
  "s00_4" -> "s0_6";
  "c11_13" -> "c111_14";
  "s1_5" -> "x_7";
  "s0_6" -> "x_7";
  "c0_8" -> "c00_10";
  "c0_8" -> "c01_11";
  "c1_9" -> "c10_12";
  "c1_9" -> "c11_13";
  "x_7" -> "c0_8";
  "x_7" -> "c1_9";
}
